Update the README.md
Change the pipeline overview
